//6
//glDrawArrays(GL_TRIANGLES, 0, 6);
//bez uv souradnic
//const float plain[] = {
//    1.0f, 0.0f,  1.0f, 0.0f, 1.0f, 0.0f,
//    1.0f, 0.0f, -1.0f, 0.0f, 1.0f, 0.0f,
//   -1.0f, 0.0f, -1.0f, 0.0f, 1.0f, 0.0f,
//
//   -1.0f, 0.0f,  1.0f, 0.0f, 1.0f, 0.0f,
//    1.0f, 0.0f,  1.0f, 0.0f, 1.0f, 0.0f,
//   -1.0f, 0.0f, -1.0f, 0.0f, 1.0f, 0.0f
//
//};

const float plain[] = {
	//vrchol, normála, uv souøadnice
	1.0f, 0.0f, 1.0f,   0.0f, 1.0f, 0.0f,   0.0f, 0.0f,
	1.0f, 0.0f,-1.0f,   0.0f, 1.0f, 0.0f,   10.0f, 0.0f,
   -1.0f, 0.0f,-1.0f,   0.0f, 1.0f, 0.0f,   10.0f, 10.0f,

   -1.0f, 0.0f, 1.0f,   0.0f, 1.0f, 0.0f,   0.0f, 10.0f,
	1.0f, 0.0f, 1.0f,   0.0f, 1.0f, 0.0f,   0.0f, 0.0f,
   -1.0f, 0.0f,-1.0f,   0.0f, 1.0f, 0.0f,   10.0f, 10.0f
};